CSI API ETABS v1
cFrameObj.DeleteLoadTemperature Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteLoadTemperature(
	string Name,
	string LoadPat,
	eItemType ItemType = eItemType.Objects
)
Function DeleteLoadTemperature (
	Name As String,
	LoadPat As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim LoadPat As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.DeleteLoadTemperature(Name,
	LoadPat, ItemType)
int DeleteLoadTemperature(
	String^ Name,
	String^ LoadPat,
	eItemType ItemType = eItemType::Objects
)
abstract DeleteLoadTemperature :
        Name : string *
        LoadPat : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
LoadPat
Type: System.String
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace